In [1]:
import pandas as pd
import numpy as np

In [8]:
s1 = np.random.randint(10,size = 5)
s2 = np.random.randint(10,size = 5)
s3 = np.random.randint(10,size = 5)

In [9]:
sozluk = {"d1":s1,"d2":s2,"d3":s3}

In [10]:
sozluk

{'d1': array([3, 6, 9, 3, 3]),
 'd2': array([1, 8, 5, 0, 4]),
 'd3': array([0, 1, 7, 2, 5])}

In [12]:
df = pd.DataFrame(sozluk)

In [13]:
df

   d1  d2  d3
0   3   1   0
1   6   8   1
2   9   5   7
3   3   0   2
4   3   4   5

In [14]:
df[0:1]

   d1  d2  d3
0   3   1   0

In [18]:
df["d1"]

0    3
1    6
2    9
3    3
4    3
Name: d1, dtype: int32

In [22]:
df.index = ["1","2","3","4","5"]

In [23]:
df

   d1  d2  d3
1   3   1   0
2   6   8   1
3   9   5   7
4   3   0   2
5   3   4   5

In [25]:
df["3":"5"]

   d1  d2  d3
3   9   5   7
4   3   0   2
5   3   4   5

In [32]:
df.drop("2",axis = 0)#satır siler

   d1  d2  d3
1   3   1   0
3   9   5   7
4   3   0   2
5   3   4   5

In [33]:
df

   d1  d2  d3
1   3   1   0
2   6   8   1
3   9   5   7
4   3   0   2
5   3   4   5

In [34]:
df = df.drop("2",axis = 0)#dataframei değiştirir

In [35]:
df

   d1  d2  d3
1   3   1   0
3   9   5   7
4   3   0   2
5   3   4   5

In [36]:
df.drop("3",axis = 0,inplace = True)#dataframe değişir

In [37]:
df

   d1  d2  d3
1   3   1   0
4   3   0   2
5   3   4   5

In [39]:
df.drop(["5","4"],axis = 0)

   d1  d2  d3
1   3   1   0

In [40]:
list = ["d1","d4","d5"]

In [55]:
df.drop("d1",axis = 1,inplace = True)#sütun silme

In [56]:
for i in list:
    print(i in df)

False
True
False

In [58]:
df["d4"] = df["d2"]*df["d2"]

In [59]:
df

   d2  d3  d4
1   1   0   1
4   0   2   0
5   4   5  16